In [5]:
import pandas as pd
import numpy as np

train_data = pd.read_csv('train.csv', index_col=0)

train_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
sex_to_num = lambda x: int(x == 'female')

In [7]:
train_data['Sex'] = train_data['Sex'].apply(sex_to_num)
train_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [24]:
X = train_data[['Pclass', 'Sex', 'Fare', 'Age']]
y = train_data['Survived']

In [25]:
X.head()

             Pclass  Sex     Fare   Age
PassengerId
1                 3    0   7.2500  22.0
2                 1    1  71.2833  38.0
3                 3    1   7.9250  26.0
4                 1    1  53.1000  35.0
5                 3    0   8.0500  35.0

In [33]:
from sklearn.neighbors import KNeighborsClassifier

X.dropna(axis=0)['Age'].mean()

29.69911764705882

In [36]:
knn = KNeighborsClassifier(n_neighbors=3)

177
177

In [39]:
X.fillna(X.dropna(axis=0)['Age'].mean(), inplace=True)
knn.fit(X,y)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=3, p=2,
           weights='uniform')

In [40]:
test_data = pd.read_csv('test.csv', index_col=0)
test_data['Sex'] = test_data['Sex'].apply(sex_to_num)
test_data.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,S

In [41]:
test_X = test_data[['Pclass', 'Sex', 'Fare', 'Age']]
test_X.head()

             Pclass  Sex     Fare   Age
PassengerId
892               3    0   7.8292  34.5
893               3    1   7.0000  47.0
894               2    0   9.6875  62.0
895               3    0   8.6625  27.0
896               3    1  12.2875  22.0

In [42]:
test_X = test_X.fillna(0)

In [43]:
test_X.isnull().sum().sum()

0

In [44]:
test_y = knn.predict(test_X)
test_X.index

Int64Index([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,
            ...
            1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
           dtype='int64', name='PassengerId', length=418)

In [45]:
df_y = pd.DataFrame({'Survived':test_y}, index=test_X.index)
df_y.to_csv('submission.csv')